Terraform plan for **dev**
```
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-048be2b9cb7b6b1bd]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-02afc56c7c66ab90a]
module.vpc.aws_subnet.public["public-2c"]: Refreshing state... [id=subnet-0cc284bd42eb330d2]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-004910369d3e90ac4]
module.vpc.aws_subnet.public["public-2a"]: Refreshing state... [id=subnet-0af73f15ac24253d1]
module.vpc.aws_subnet.data["private-data-2c"]: Refreshing state... [id=subnet-0fdddc26dd2010072]
module.vpc.aws_subnet.app["private-app-2c"]: Refreshing state... [id=subnet-0fbfc1da61c5010c2]
module.vpc.aws_route_table.app: Refreshing state... [id=rtb-01f0e7d6e99e722ae]
module.vpc.aws_route_table.data: Refreshing state... [id=rtb-0702377253990a54e]
module.vpc.aws_subnet.app["private-app-2a"]: Refreshing state... [id=subnet-0e5f2fcba1d2c82d1]
module.vpc.aws_subnet.data["private-data-2a"]: Refreshing state... [id=subnet-08bbe978660fcf3bc]
module.security_groups.aws_security_group.alb: Refreshing state... [id=sg-07304148564cfa227]
module.security_groups.aws_security_group.kafka: Refreshing state... [id=sg-0faf52ebc2cd2a44f]
module.security_groups.aws_security_group.cache: Refreshing state... [id=sg-0232bead13f49e96c]
module.security_groups.aws_security_group.ecs: Refreshing state... [id=sg-0fa310218f78ec9d5]
module.security_groups.aws_security_group.db: Refreshing state... [id=sg-09e7b5fdd2902b3e7]
module.vpc.aws_route.public_internet: Refreshing state... [id=r-rtb-004910369d3e90ac41080289494]
module.security_groups.aws_security_group_rule.alb_ingress_https: Refreshing state... [id=sgrule-1603903678]
module.security_groups.aws_security_group_rule.alb_ingress_http: Refreshing state... [id=sgrule-2881589378]
module.vpc.aws_route_table_association.public["public-2c"]: Refreshing state... [id=rtbassoc-022002a1f07a0052a]
module.vpc.aws_route_table_association.public["public-2a"]: Refreshing state... [id=rtbassoc-069441f5497aa12f6]
module.vpc.aws_route_table_association.data["private-data-2a"]: Refreshing state... [id=rtbassoc-046d8223d4a344338]
module.vpc.aws_route_table_association.data["private-data-2c"]: Refreshing state... [id=rtbassoc-0e59efb103334caa1]
module.vpc.aws_route_table_association.app["private-app-2a"]: Refreshing state... [id=rtbassoc-03f007eb846c35876]
module.vpc.aws_route_table_association.app["private-app-2c"]: Refreshing state... [id=rtbassoc-0db188dbe0c30668e]
module.security_groups.aws_security_group_rule.alb_egress_ecs: Refreshing state... [id=sgrule-2054563638]
module.security_groups.aws_security_group_rule.ecs_ingress_from_alb: Refreshing state... [id=sgrule-792169314]
module.security_groups.aws_security_group_rule.ecs_egress_https: Refreshing state... [id=sgrule-1751620221]
module.security_groups.aws_security_group_rule.ecs_ingress_from_ecs: Refreshing state... [id=sgrule-3577701755]
module.security_groups.aws_security_group_rule.cache_ingress_from_ecs: Refreshing state... [id=sgrule-3049031030]
module.security_groups.aws_security_group_rule.ecs_egress_kafka["9094"]: Refreshing state... [id=sgrule-1428771071]
module.security_groups.aws_security_group_rule.ecs_egress_kafka["9092"]: Refreshing state... [id=sgrule-3431418780]
module.security_groups.aws_security_group_rule.ecs_egress_cache: Refreshing state... [id=sgrule-3023808897]
module.security_groups.aws_security_group_rule.kafka_ingress_from_ecs["9092"]: Refreshing state... [id=sgrule-3882159306]
module.security_groups.aws_security_group_rule.kafka_ingress_from_ecs["9094"]: Refreshing state... [id=sgrule-860328499]
module.security_groups.aws_security_group_rule.db_ingress_from_ecs: Refreshing state... [id=sgrule-4244990519]
module.security_groups.aws_security_group_rule.ecs_egress_db: Refreshing state... [id=sgrule-4073593148]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.ecr.aws_ecr_repository.this["goorm-popcorn-order"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "goorm-popcorn-order"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "goorm-popcorn-order"
        }
      + tags_all             = {
          + "Name" = "goorm-popcorn-order"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository.this["goorm-popcorn-order-query"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "goorm-popcorn-order-query"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "goorm-popcorn-order-query"
        }
      + tags_all             = {
          + "Name" = "goorm-popcorn-order-query"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository.this["goorm-popcorn-payment"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "goorm-popcorn-payment"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "goorm-popcorn-payment"
        }
      + tags_all             = {
          + "Name" = "goorm-popcorn-payment"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository.this["goorm-popcorn-qr"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "goorm-popcorn-qr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "goorm-popcorn-qr"
        }
      + tags_all             = {
          + "Name" = "goorm-popcorn-qr"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository.this["goorm-popcorn-store"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "goorm-popcorn-store"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "goorm-popcorn-store"
        }
      + tags_all             = {
          + "Name" = "goorm-popcorn-store"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository.this["goorm-popcorn-user"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "goorm-popcorn-user"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "goorm-popcorn-user"
        }
      + tags_all             = {
          + "Name" = "goorm-popcorn-user"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.security_groups.aws_security_group.alb will be updated in-place
  ~ resource "aws_security_group" "alb" {
      ~ egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "ALB to ECS app port"
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0fa310218f78ec9d5",
                ]
              - self             = false
              - to_port          = 8080
            },
        ]
        id                     = "sg-07304148564cfa227"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTP from internet"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTPS from internet"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ]
        name                   = "goorm-popcorn-sg-alb"
        tags                   = {
            "Name" = "sg-alb"
        }
        # (6 unchanged attributes hidden)
    }

  # module.security_groups.aws_security_group.cache will be updated in-place
  ~ resource "aws_security_group" "cache" {
        id                     = "sg-0232bead13f49e96c"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "ElastiCache from ECS"
              - from_port        = 6379
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0fa310218f78ec9d5",
                ]
              - self             = false
              - to_port          = 6379
            },
        ]
        name                   = "goorm-popcorn-sg-cache"
        tags                   = {
            "Name" = "sg-cache"
        }
        # (7 unchanged attributes hidden)
    }

  # module.security_groups.aws_security_group.db will be updated in-place
  ~ resource "aws_security_group" "db" {
        id                     = "sg-09e7b5fdd2902b3e7"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Aurora from ECS"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0fa310218f78ec9d5",
                ]
              - self             = false
              - to_port          = 5432
            },
        ]
        name                   = "goorm-popcorn-sg-db"
        tags                   = {
            "Name" = "sg-db"
        }
        # (7 unchanged attributes hidden)
    }

  # module.security_groups.aws_security_group.ecs will be updated in-place
  ~ resource "aws_security_group" "ecs" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "ECS to internet HTTPS (via NAT/endpoint)"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "ECS to Aurora"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-09e7b5fdd2902b3e7",
                ]
              - self             = false
              - to_port          = 5432
            },
          - {
              - cidr_blocks      = []
              - description      = "ECS to ElastiCache"
              - from_port        = 6379
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0232bead13f49e96c",
                ]
              - self             = false
              - to_port          = 6379
            },
          - {
              - cidr_blocks      = []
              - description      = "ECS to MSK"
              - from_port        = 9092
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0faf52ebc2cd2a44f",
                ]
              - self             = false
              - to_port          = 9092
            },
          - {
              - cidr_blocks      = []
              - description      = "ECS to MSK"
              - from_port        = 9094
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0faf52ebc2cd2a44f",
                ]
              - self             = false
              - to_port          = 9094
            },
        ]
        id                     = "sg-0fa310218f78ec9d5"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "ECS from ALB"
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-07304148564cfa227",
                ]
              - self             = false
              - to_port          = 8080
            },
          - {
              - cidr_blocks      = []
              - description      = "ECS service-to-service"
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 8080
            },
        ]
        name                   = "goorm-popcorn-sg-ecs"
        tags                   = {
            "Name" = "sg-ecs"
        }
        # (6 unchanged attributes hidden)
    }

  # module.security_groups.aws_security_group.kafka will be updated in-place
  ~ resource "aws_security_group" "kafka" {
        id                     = "sg-0faf52ebc2cd2a44f"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "MSK from ECS"
              - from_port        = 9092
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0fa310218f78ec9d5",
                ]
              - self             = false
              - to_port          = 9092
            },
          - {
              - cidr_blocks      = []
              - description      = "MSK from ECS"
              - from_port        = 9094
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0fa310218f78ec9d5",
                ]
              - self             = false
              - to_port          = 9094
            },
        ]
        name                   = "goorm-popcorn-sg-kafka"
        tags                   = {
            "Name" = "sg-kafka"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 6 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```